app/views/matchings/show.html.erb

SELECT `participants`.* FROM `participants`  WHERE `participants`.`matching_id` = 1
---
  <strong>Participant:</strong>
  <% @create_matching.participants.each do |participant| %>