app/views/users/_projects_list.html.erb

SELECT `projects`.* FROM `projects`  WHERE (genre = 'RPG')
---
  <ul>
    <% projects = Project.where("genre = ?", "RPG") %>