app/views/users/show.html.erb

SELECT `favorites`.* FROM `favorites`  WHERE `favorites`.`user_id` = 2
---
<ul>
<% @user.favorites.each do |favorite| %>