app/views/projects/show.html.erb


<% @project.tasks.each.with_index do |task, i| %>
---
SELECT `tasks`.* FROM `tasks`  WHERE `tasks`.`project_id` = 1