app/controllers/favorites_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 2 LIMIT 1
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`title` = 'たまごっち' LIMIT 1
INSERT INTO `favorites` (`created_at`, `project_id`, `title`, `updated_at`, `user_id`) VALUES ('2014-10-26 08:46:55', 13, 'たまごっち', '2014-10-26 08:46:55', 2)
---
	def create
		@user = User.find(params[:user_id])
		@project = Project.find_by(title: params[:title])
		if @project.nil? || is_redundant_title?
			redirect_to user_path(@user.name)
		else
			@favorite = @user.favorites.create(title: params[:title], project_id: params[:project_id])