app/controllers/matchings_controller.rb

  def index
    @create_matchings = Matching.where(project_id: params[:project_id])
    @project = Project.find(params[:project_id])
---
SELECT `matchings`.* FROM `matchings`  WHERE `matchings`.`id` IN ('all', '---\n:conditions:\n  :project_id: \'1\'\n')
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 1 LIMIT 1

  def show
    @create_matching = Matching.find(params[:id])
---
SELECT  `matchings`.* FROM `matchings`  WHERE `matchings`.`id` = 1 LIMIT 1

  def new
    @project = Project.find(params[:project_id])
---
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 0 LIMIT 1

  def edit
    @project = Project.find(params[:project_id])
---
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 2 LIMIT 1

  def create
    @project = Project.find(params[:project_id])
    @create_matching = @project.matchings.create(create_matching_params)
---
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 1 LIMIT 1
INSERT INTO `matchings` (`created_at`, `limit`, `memo`, `name`, `owner`, `project_id`, `reguration`, `start`, `title`, `updated_at`) VALUES ('2014-11-14 14:21:56', '2014-11-14 14:21:00', '', 'gnfd', 'gugoufo', 1, 'fufou', '2014-11-14 14:21:00', 'foufou', '2014-11-14 14:21:56')

  def update
    if @create_matching.memo.include?("")
      @create_matching.memo = "なし"
      @create_matching.save
---
UPDATE `matchings` SET `limit` = '2014-11-14 17:00:00', `updated_at` = '2014-11-14 16:55:16' WHERE `matchings`.`id` = 2

  def destroy
    @create_matching.destroy
---
DELETE FROM `matchings` WHERE `matchings`.`id` = 1

  def set_create_matching
    @create_matching = Matching.find(params[:id])
---
SELECT  `matchings`.* FROM `matchings`  WHERE `matchings`.`id` = 2 LIMIT 1