app/controllers/participants_controller.rb

  def new
    @matching = Matching.find(params[:matching_id])
---
SELECT  `matchings`.* FROM `matchings`  WHERE `matchings`.`id` = 14 LIMIT 1

  def create
    @matching = Matching.find(params[:matching_id])
    @participant = @matching.participants.build(participant_params)
    respond_to do |format|
      if @participant.save
---
SELECT  `matchings`.* FROM `matchings`  WHERE `matchings`.`id` = 14 LIMIT 1
INSERT INTO `participants` (`created_at`, `matching_id`, `name`, `updated_at`) VALUES ('2014-11-17 15:27:09', 14, '真姫', '2014-11-17 15:27:09')

  def set_participant
    @matching = Matching.find(params[:matching_id])
    @participant = @matching.participants.find(params[:id])
---
SELECT  `matchings`.* FROM `matchings`  WHERE `matchings`.`id` = 14 LIMIT 1
SELECT  `participants`.* FROM `participants`  WHERE `participants`.`matching_id` = 14 AND `participants`.`id` = 14 LIMIT 1