app/controllers/projects_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`name` IS NULL LIMIT 1
---
	def show
		@user = User.find_by(:name => params[:user_id])

INSERT INTO `projects` (`created_at`, `genre`, `title`, `updated_at`) VALUES ('2014-11-24 10:13:27', 'RPG', 'ペルソナ', '2014-11-24 10:13:27')
---
	def create
		@project = Project.new(project_params)
		if @project.save

UPDATE `projects` SET `title` = 'p4', `updated_at` = '2014-10-11 01:29:58' WHERE `projects`.`id` = 4
---
	def update
		if @project.update(project_params)

DELETE FROM `projects` WHERE `projects`.`id` = 4
---
	def destroy
		@project.destroy

SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 4 LIMIT 1
---
	def set_project
		@project = Project.find(params[:id])