app/controllers/tasks_controller.rb

SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 1 LIMIT 1
INSERT INTO `tasks` (`created_at`, `project_id`, `title`, `updated_at`) VALUES ('2014-10-11 02:18:32', 1, '1', '2014-10-11 02:18:32')
---
	def create
		@project = Project.find(params[:project_id])
		@task = @project.tasks.create(task_params)

SELECT  `tasks`.* FROM `tasks`  WHERE `tasks`.`id` = 1 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 1
---
	def destroy
		@task = Task.find(params[:id])
		@task.destroy