app/controllers/users_controller.rb

	def show
		@user = User.find_by(:name => params[:id])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`name` = 'Sano' LIMIT 1